[
  {
    "task": "Hey there folks, you have chosen Dart Path! \n\nHere's your first task! All the best...\n\n * A Dart script needs the main() method for execution.\n\n\tFor example: \n\n\t void main() {\n\n\t print('Hello World');\n\n\t} \n\n * The main() function is a predefined method in Dart. \n * This method acts as the entry point to the application.\n\n Task 1:-\n Print Hello World to the console using the pre-built print function. "
  },
  {
    "task": "\nNow lets focus on variables, A variable is “a named space in the memory” that stores values. \n In dart a variable must be declared before it is used. \n\n * Dart uses the var keyword to achieve the same. \n\n\tvar name = 'Dart';\n\n\tThe variable called [name] contains a reference to a String object with a value of 'Dart'. \n\n * Dart supports type-checking by prefixing the variable name with the data type.\n\n\tfor example: \n\n\tString name = 'Smith'; \n\tint num = 10; \n\tdouble val = 22.0;\n\t boolean isBoolean = false;\n\tList<String> listOfStrings = [\"hello\", \"Hai\"];\n\nTask 2:- \n\nDeclare variables of types [int] and [string]. \nAssign 12 to the integer variable and 'John' to the string variable and print both variables. "
  },
  {
    "task": "\nKeep it up!\n\nStrings represent a group of characters. String literals in dart are surrounded by either single quotation marks, or double quotation marks. \nDart provides various prebuilt functions to deal with strings, say to find the length of a string, convert it to lower case etc.\n\nTask-3\n\nDeclare a variable str and initialize it with hello world Print it in upper case and also the length in order"
  },
  {
    "task": "Let's learn more on String methods. There are a variety of methods for string manipulation in Dart. Some of them are: \n 1. length - To find the length of the string. \n 2. indexOf() - Returns the first occurence of a specified text in a string. \n 3. substring() - extracts a part of a string and returns the extracted part. \n 4. replaceAll() - replaces a specified value with another value in a string. \n 6. split() - Splits the string at matches of the specified delimiter and returns a list of substrings. \n\n Task 4:-\n\n Obtain the following output for the string 'Hey, this is Task 4 of Dart Path!' \n\n Output: \n Length of the string \n Display the index of first occurence of 'Task' \n Replace Dart with Python  \n Split the string based on space."
  }
]
